name: "anime_gan_hayao"
platform: "onnxruntime_onnx"
default_model_filename: "model.onnx"
max_batch_size: 0

input [
  {
    name: "generator_input:0"
    data_type: TYPE_FP32
    dims: [ 1, -1, -1, 3 ]
  }
]

output [
  {
    name: "generator/G_MODEL/out_layer/Tanh:0"
    data_type: TYPE_FP32
    dims: [ 1, -1, -1, 3 ]
  }
]

instance_group [ { kind: KIND_GPU } ]
optimization {
  execution_accelerators {
    gpu_execution_accelerator: [ { name: "tensorrt" } ]
  }
}
