name: "real_esrgan_x4"
platform: "onnxruntime_onnx"
default_model_filename: "model.onnx"
max_batch_size: 0

input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [ 1, 3, 128, 128 ]
  }
]

output [
  {
    name: "upscaled_image"
    data_type: TYPE_FP32
    dims: [ 3, 512, 512 ]
  }
]

instance_group [ { kind: KIND_GPU } ]
optimization {
  execution_accelerators {
    gpu_execution_accelerator: [ { name: "tensorrt" } ]
  }
}
